{
    "intents": [
        {
            "tag": "saludo",
            "patterns": ["Hola", "¿Como estas?", "Buenos dias"],
            "responses": [
                "¡Hola! Soy el chatbot de administracion de tareas. ¿En que puedo ayudarte?",
                "Hola, ¿en que puedo hacer por ti?"
            ],
            "context_set": ""
        },
        {
            "tag": "presentacion",
            "patterns": ["¿Quien eres?", "Explicame quien eres"],
            "responses": [
                "Soy el chatbot de gestion de tareas para ingenieros ambientales."
            ],
            "context_set": ""
        },
        {
            "tag": "funcionalidad",
            "patterns": [
                "¿Cuales son las funcionalidades del sistema?",
                "Explicame como funciona el sistema"
            ],
            "responses": [
                "El sistema de administracion de tareas esta diseñado para ingenieros ambientales. Puedes gestionar tareas, usuarios y obtener informacion a traves de una dashboard. ¿Hay algo especifico que te gustaria saber?"
            ],
            "context_set": ""
        },
        {
            "tag": "tipos_tareas",
            "patterns": [
                "¿Cuales son los tipos de tareas disponibles?",
                "Dime sobre los tipos de tareas"
            ],
            "responses": [
                "Las tareas pueden ser de agua, reciclaje, aire y quimico, con prioridades (alta, media, baja) y estados (sin iniciar, en proceso, ejecutada)."
            ],
            "context_set": ""
        },
        {
            "tag": "dashboard",
            "patterns": [
                "Explicame la dashboard",
                "¿Como funciona la dashboard?"
            ],
            "responses": [
                "Proporciona informacion sobre tareas y usuarios, como tareas totales y porcentajes segun estado, prioridad y tipo."
            ],
            "context_set": ""
        },
        {
            "tag": "crear_tarea",
            "patterns": [
                "¿Como puedo crear una nueva tarea?",
                "Explicame el proceso para crear una tarea"
            ],
            "responses": [
                "Solo administradores pueden crear tareas, ingresando titulo, tipo, prioridad y fecha limite."
            ],
            "context_set": ""
        },
        {
            "tag": "asignar_tarea",
            "patterns": [
                "¿Como asigno una tarea a un empleado?",
                "Explicame como asignar tareas"
            ],
            "responses": [
                "Los administradores asignan tareas a empleados desde la seccion de tareas."
            ],
            "context_set": ""
        },
        {
            "tag": "editar_tarea",
            "patterns": [
                "¿Puedo editar una tarea despues de crearla?",
                "¿Como puedo modificar una tarea existente?"
            ],
            "responses": [
                "Solo administradores pueden editar tareas desde la seccion de tareas."
            ],
            "context_set": ""
        },
        {
            "tag": "eliminar_tarea",
            "patterns": [
                "¿Como elimino una tarea?",
                "Explicame el proceso para eliminar una tarea"
            ],
            "responses": [
                "Solo administradores pueden eliminar tareas desde la seccion de tareas."
            ],
            "context_set": ""
        },
        {
            "tag": "roles",
            "patterns": [
                "Hablame sobre los roles en el sistema",
                "¿Cuales son los roles disponibles?"
            ],
            "responses": [
                "Hay dos roles: administrador (gestiona todo) y empleado (ver y cambiar estado de tareas asignadas)."
            ],
            "context_set": ""
        },
        {
            "tag": "adjuntar_observacion",
            "patterns": [
                "¿Como puedo adjuntar una observacion a una tarea?",
                "Explicame como agregar comentarios a una tarea"
            ],
            "responses": [
                "Administradores y empleados pueden adjuntar observaciones a las tareas desde la seccion correspondiente."
            ],
            "context_set": ""
        },
        {
            "tag": "ver_usuarios",
            "patterns": [
                "¿Como puedo ver la lista de usuarios?",
                "Explicame como visualizar la lista de usuarios"
            ],
            "responses": [
                "Administradores pueden ver usuarios desde la seccion de usuarios, con detalles sobre su rol y cantidad."
            ],
            "context_set": ""
        },
        {
            "tag": "eliminar_usuario",
            "patterns": [
                "¿Como puedo eliminar un usuario?",
                "Explicame el proceso para eliminar un usuario"
            ],
            "responses": [
                "Solo administradores pueden eliminar usuarios desde la seccion de usuarios."
            ],
            "context_set": ""
        },
        {
            "tag": "crear_usuario",
            "patterns": [
                "¿Como creo un nuevo usuario?",
                "Explicame el proceso para crear un usuario"
            ],
            "responses": [
                "Solo administradores pueden crear usuarios mediante el formulario o subiendo un archivo Excel con informacion de usuarios."
            ],
            "context_set": ""
        },
        {
            "tag": "prioridades",
            "patterns": [
                "Hablame sobre las prioridades de las tareas",
                "¿Cuales son las prioridades disponibles?"
            ],
            "responses": [
                "Las tareas pueden tener prioridad alta, media o baja para establecer su importancia relativa."
            ],
            "context_set": ""
        }
    ]
}
